## Plan Result (prod-backendappgateway)




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw"
        name                              = "cft-aks00-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendAddressPools/ccd-case-activity-api" -> null
          - ip_addresses = [
              - "10.90.79.250",
              - "10.90.95.250",
            ] -> null
          - name         = "ccd-case-activity-api" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/aac-manage-case-assignment" -> null
          - name                                = "aac-manage-case-assignment" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/aac-manage-case-assignment" -> null
          - probe_name                          = "aac-manage-case-assignment" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/adoption-cos-api" -> null
          - name                                = "adoption-cos-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/adoption-cos-api" -> null
          - probe_name                          = "adoption-cos-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/am-org-role-mapping-service" -> null
          - name                                = "am-org-role-mapping-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/am-org-role-mapping-service" -> null
          - probe_name                          = "am-org-role-mapping-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/am-role-assignment-service" -> null
          - name                                = "am-role-assignment-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/am-role-assignment-service" -> null
          - probe_name                          = "am-role-assignment-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/bar-api" -> null
          - name                                = "bar-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/bar-api" -> null
          - probe_name                          = "bar-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/bulk-scan-orchestrator" -> null
          - name                                = "bulk-scan-orchestrator" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/bulk-scan-orchestrator" -> null
          - probe_name                          = "bulk-scan-orchestrator" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/bulk-scan-payment-processor" -> null
          - name                                = "bulk-scan-payment-processor" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/bulk-scan-payment-processor" -> null
          - probe_name                          = "bulk-scan-payment-processor" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/bulk-scan-processor" -> null
          - name                                = "bulk-scan-processor" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/bulk-scan-processor" -> null
          - probe_name                          = "bulk-scan-processor" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/camunda-api" -> null
          - name                                = "camunda-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/camunda-api" -> null
          - probe_name                          = "camunda-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/ccd-admin-web" -> null
          - name                                = "ccd-admin-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/ccd-admin-web" -> null
          - probe_name                          = "ccd-admin-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/ccd-case-activity-api" -> null
          - name                                = "ccd-case-activity-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/ccd-case-activity-api" -> null
          - probe_name                          = "ccd-case-activity-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/ccd-case-document-am-api" -> null
          - name                                = "ccd-case-document-am-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/ccd-case-document-am-api" -> null
          - probe_name                          = "ccd-case-document-am-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/ccd-case-print-service" -> null
          - name                                = "ccd-case-print-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/ccd-case-print-service" -> null
          - probe_name                          = "ccd-case-print-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/ccd-data-store-api" -> null
          - name                                = "ccd-data-store-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/ccd-data-store-api" -> null
          - probe_name                          = "ccd-data-store-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/ccd-definition-store-api" -> null
          - name                                = "ccd-definition-store-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/ccd-definition-store-api" -> null
          - probe_name                          = "ccd-definition-store-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/ccd-message-publisher" -> null
          - name                                = "ccd-message-publisher" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/probes/ccd-message-publisher" -> null
          - probe_name                          = "ccd-message-publisher" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw/backendHttpSettingsCollection/ccd-user-profile-api" -> null
          - name                                = "ccd-user-profile-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                    

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

> null
          - name                       = "sptribs-case-api" -> null
          - priority                   = 130 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/sscs-hearings-api" -> null
          - backend_address_pool_name  = "sscs-hearings-api" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/sscs-hearings-api" -> null
          - backend_http_settings_name = "sscs-hearings-api" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/sscs-hearings-api" -> null
          - http_listener_name         = "sscs-hearings-api" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/sscs-hearings-api" -> null
          - name                       = "sscs-hearings-api" -> null
          - priority                   = 60 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ts-translation-service" -> null
          - backend_address_pool_name  = "ts-translation-service" -> null
          - backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/ts-translation-service" -> null
          - backend_http_settings_name = "ts-translation-service" -> null
          - http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/ts-translation-service" -> null
          - http_listener_name         = "ts-translation-service" -> null
          - id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/ts-translation-service" -> null
          - name                       = "ts-translation-service" -> null
          - priority                   = 70 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-cos"
          + backend_address_pool_name  = "et-cos"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-cos"
          + backend_http_settings_name = "et-cos"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-cos"
          + http_listener_name         = "et-cos"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/et-cos"
          + name                       = "et-cos"
          + priority                   = 20
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-hearings-api"
          + backend_address_pool_name  = "et-hearings-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-hearings-api"
          + backend_http_settings_name = "et-hearings-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-hearings-api"
          + http_listener_name         = "et-hearings-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/et-hearings-api"
          + name                       = "et-hearings-api"
          + priority                   = 50
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-msg-handler"
          + backend_address_pool_name  = "et-msg-handler"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-msg-handler"
          + backend_http_settings_name = "et-msg-handler"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-msg-handler"
          + http_listener_name         = "et-msg-handler"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/et-msg-handler"
          + name                       = "et-msg-handler"
          + priority                   = 30
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-sya-api"
          + backend_address_pool_name  = "et-sya-api"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-sya-api"
          + backend_http_settings_name = "et-sya-api"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-sya-api"
          + http_listener_name         = "et-sya-api"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/et-sya-api"
          + name                       = "et-sya-api"
          + priority                   = 40
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/plum-recipe-backend"
          + backend_address_pool_name  = "plum-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/plum-recipe-backend"
          + backend_http_settings_name = "plum-recipe-backend"
          + http_listener_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/plum-recipe-backend"
          + http_listener_name         = "plum-recipe-backend"
          + id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/requestRoutingRules/plum-recipe-backend"
          + name                       = "plum-recipe-backend"
          + priority                   = 10
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "am-judicial-booking-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "am-judicial-booking-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "am-judicial-booking-service"
          + id                         = (known after apply)
          + name                       = "am-judicial-booking-service"
          + priority                   = 130
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ccd-case-activity-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ccd-case-activity-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ccd-case-activity-api"
          + id                         = (known after apply)
          + name                       = "ccd-case-activity-api"
          + priority                   = 60
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dtsse-ardoq-adapter"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dtsse-ardoq-adapter"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dtsse-ardoq-adapter"
          + id                         = (known after apply)
          + name                       = "dtsse-ardoq-adapter"
          + priority                   = 150
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-bulk-scan-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-bulk-scan-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-bulk-scan-api"
          + id                         = (known after apply)
          + name                       = "fis-bulk-scan-api"
          + priority                   = 90
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-cos-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-cos-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-cos-api"
          + id                         = (known after apply)
          + name                       = "fis-cos-api"
          + priority                   = 100
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-hmc-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-hmc-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-hmc-api"
          + id                         = (known after apply)
          + name                       = "fis-hmc-api"
          + priority                   = 110
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ia-bail-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ia-bail-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ia-bail-case-api"
          + id                         = (known after apply)
          + name                       = "ia-bail-case-api"
          + priority                   = 120
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "jps-judicial-payment-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "jps-judicial-payment-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "jps-judicial-payment-service"
          + id                         = (known after apply)
          + name                       = "jps-judicial-payment-service"
          + priority                   = 160
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sptribs-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sptribs-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sptribs-case-api"
          + id                         = (known after apply)
          + name                       = "sptribs-case-api"
          + priority                   = 140
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-hearings-api"
          + id                         = (known after apply)
          + name                       = "sscs-hearings-api"
          + priority                   = 70
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ts-translation-service"
          + id                         = (known after apply)
          + name                       = "ts-translation-service"
          + priority                   = 80
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (25 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1601,"Program":"tfcmt","SHA1":"","Target":"prod-backendappgateway","Vars":{}} -->